load-test.yml
config:
  target: 'http://localhost:1234'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 120
      arrivalRate: 200
      name: "High load"
    - duration: 60
      arrivalRate: 500
      name: "Peak load"
    - duration: 120
      arrivalRate: 1000
      name: "Stress test"
    - duration: 300
      arrivalRate: 2000
      name: "Load to failure"

scenarios:
  - name: "GET /api/v1/tasks"
    weight: 40
    flow:
      - get:
          url: "/api/v1/tasks"
  
  - name: "POST /api/v1/tasks"
    weight: 30
    flow:
      - post:
          url: "/api/v1/tasks"
          json:
            name: "Load test task {{ $randomString() }}"
            search: "load test {{ $randomString() }}"
          headers:
            Content-Type: "application/json"
  
  - name: "PUT /api/v1/tasks"
    weight: 20
    flow:
      - get:
          url: "/api/v1/tasks"
          capture:
            - json: "$[0].id"
              as: "taskId"
      - put:
          url: "/api/v1/tasks/{{ taskId }}"
          json:
            name: "Updated load test task {{ $randomString() }}"
            search: "updated load test {{ $randomString() }}"
          headers:
            Content-Type: "application/json"
  
  - name: "DELETE /api/v1/tasks"
    weight: 10
    flow:
      - get:
          url: "/api/v1/tasks"
          capture:
            - json: "$[0].id"
              as: "taskId"
      - delete:
          url: "/api/v1/tasks/{{ taskId }}"